** Roam
#+begin_src emacs-lisp
(after! org-roam
    (setq org-roam-dailies-directory "daily/")
    (setq org-roam-dailies-capture-templates
      `(("d" "default" entry
         "* %<%H-%M> %?"
         :if-new
            (file+head "%(concat org-roam-dailies-directory \"/%<%Y-%m-%d>.org\")"
                    "#+title: %<%Y-%m-%d>"))))

    (setq org-roam-completion-everywhere nil)       ;; Отключить везде
    (setq org-roam-completion-system 'none)       ;; Никакого дополнения
)
#+end_src

#+RESULTS:
| d | default | entry | * %<%H-%M> %? | :if-new | (file+head %(concat org-roam-dailies-directory "/%<%Y-%m-%d>.org") #+title: %<%Y-%m-%d> |

